app/views/elements/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."element_id" = ?  [["element_id", 1]]
---
        <td class="btn btn-default btn-xs" role="button"><%= link_to 'Destroy', element, method: :delete, data: { confirm: 'Are you sure?' } %></td>
        <td><%= pluralize(element.votes.count, "like") %></td>