app/views/elements/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."element_id" = ?  [["element_id", 1]]
---
<h4 class="cmnt">Comments</h4>
<% @element.comments.each do |comment| %>