app/controllers/comments_controller.rb

SELECT  "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "element_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "jini@ymail.com"], ["body", "Very cute and inspirational song\r\n"], ["element_id", 4], ["created_at", 2017-03-20 10:30:16 UTC], ["updated_at", 2017-03-20 10:30:16 UTC]]
---
    def create
        @element = Element.find(params[:element_id])
        @comment = @element.comments.create(comment_params)