app/controllers/elements_controller.rb

  def index
    @elements = Element.all
---
SELECT "elements".* FROM "elements"

  def create
    @element = Element.new(element_params)

    respond_to do |format|
      if @element.save
---
INSERT INTO "elements" ("song", "movie", "lyric", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @element.update(element_params)
---
UPDATE "elements" SET "lyric" = ?, "updated_at" = ? WHERE "elements"."id" = ?

  def upvote
    @element = Element.find(params[:id])
    @element.votes.create(user_id: current_user.id)
---
SELECT  "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("element_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["element_id", 5], ["created_at", 2017-03-21 04:58:43 UTC], ["updated_at", 2017-03-21 04:58:43 UTC], ["user_id", 2]]

  def downvote
    @element = Element.find(params[:id])

    if @element.votes.where(user_id: current_user.id).exists?
      @element.votes.first.destroy
---
SELECT  "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."element_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["element_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "votes" WHERE "votes"."element_id" = ? AND "votes"."user_id" = ? LIMIT ?  [["element_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 11]]

    def set_element
      @element = Element.find(params[:id])
---
SELECT  "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]